'use client';

import { useFavourites } from '../../contexts/FavouritesContext';
import ProductCard from '../../components/ProductCard';
import styles from './page.module.css';
import Link from 'next/link';

export default function FavoritesPage() {
  const { favourites, isLoading } = useFavourites();

  return (
    <main className={styles.main}>
      <div className={styles.breadcrumbs}>
        <Link href="/" className={styles.breadcrumbLink}>
          Главная
        </Link>
        <span className={styles.breadcrumbArrow}><svg width="6" height="11" viewBox="0 0 6 11" fill="none" xmlns="http://www.w3.org/2000/svg">
  <path d="M0.142188 1.34362C0.0970788 1.29589 0.0618143 1.23974 0.0384064 1.17837C0.0149984 1.11701 0.00390625 1.05163 0.00576353 0.985982C0.00762081 0.920331 0.0223908 0.855689 0.0492301 0.795746C0.0760694 0.735803 0.114452 0.681734 0.162188 0.636625C0.209924 0.591515 0.266077 0.55625 0.327441 0.532843C0.388805 0.509435 0.454179 0.498343 0.51983 0.5002C0.585481 0.502057 0.650124 0.516827 0.710067 0.543666C0.77001 0.570506 0.824079 0.608889 0.869188 0.656625L5.11919 5.15662C5.20696 5.24946 5.25586 5.37237 5.25586 5.50012C5.25586 5.62788 5.20696 5.75079 5.11919 5.84362L0.869188 10.3441C0.824377 10.3929 0.770319 10.4323 0.710156 10.46C0.649992 10.4877 0.584923 10.5032 0.518725 10.5056C0.452528 10.5079 0.386523 10.4971 0.324545 10.4737C0.262567 10.4503 0.20585 10.4149 0.15769 10.3694C0.109529 10.3239 0.0708852 10.2693 0.0440021 10.2088C0.0171189 10.1483 0.00253296 10.083 0.00109053 10.0168C-0.000351906 9.95053 0.0113788 9.88468 0.0356007 9.82303C0.0598226 9.76138 0.0960531 9.70516 0.142188 9.65763L4.06819 5.50012L0.142188 1.34362Z" fill="#323433" fillOpacity="0.5" />
</svg></span>
        <span className={styles.breadcrumbCurrent}>Избранное</span>
      </div>

      {isLoading ? (
        <div className={styles.loadingContainer}>
          <div className={styles.loading}>Загрузка избранного...</div>
        </div>
      ) : favourites.length > 0 ? (
        <div className={styles.favoritesContainer}>
          <div className={styles.titleSection}>
            <h1 className={styles.title}>Избранное</h1>
            <p className={styles.favoritesCount}>
              {favourites.length} {favourites.length === 1 ? 'товар' : favourites.length < 5 ? 'товара' : 'товаров'}
            </p>
          </div>
          
          <div className={styles.productsGrid}>
            {favourites.map((product) => (
              <ProductCard key={product.id} product={product} />
            ))}
          </div>
        </div>
      ) : (
        <div className={styles.content}>
          <div className={styles.titleSection}>
            <h1 className={styles.title}>Избранное</h1>
            <div className={styles.description}>
              <p>
                Нажимайте на{' '}
                <span className={styles.heartIcon}><svg width="22" height="19" viewBox="0 0 22 19" fill="none" xmlns="http://www.w3.org/2000/svg">
  <path fillRule="evenodd" clipRule="evenodd" d="M18.6954 8.72567C19.4908 7.91769 19.9327 6.8268 19.9239 5.69301C19.915 4.55921 19.4561 3.47537 18.6481 2.67992C18.2481 2.28605 17.7743 1.97484 17.254 1.76405C16.7337 1.55327 16.1769 1.44704 15.6155 1.45143C14.4817 1.46029 13.3978 1.91919 12.6024 2.72717C12.3864 2.94317 12.1119 3.20829 11.7789 3.52254L10.853 4.39442L9.92715 3.52254C9.5934 3.20754 9.31852 2.94242 9.10252 2.72717C8.30081 1.92545 7.21344 1.47506 6.07965 1.47506C4.94585 1.47506 3.85849 1.92545 3.05677 2.72717C1.40527 4.37979 1.38615 7.05167 2.99602 8.71217L10.853 16.5692L18.6954 8.72567ZM2.10165 1.77317C2.624 1.25068 3.24416 0.836213 3.92671 0.553438C4.60926 0.270662 5.34084 0.125118 6.07965 0.125118C6.81846 0.125118 7.55003 0.270662 8.23258 0.553438C8.91514 0.836213 9.5353 1.25068 10.0576 1.77317C10.2624 1.97867 10.5275 2.23442 10.853 2.54042C11.177 2.23442 11.4421 1.97829 11.6484 1.77204C12.6952 0.709104 14.1214 0.105551 15.6133 0.0941584C17.1051 0.0827656 18.5403 0.664466 19.6033 1.71129C20.6662 2.75812 21.2698 4.18432 21.2812 5.67615C21.2925 7.16798 20.7108 8.60323 19.664 9.66617L11.6484 17.6829C11.4374 17.8938 11.1513 18.0123 10.853 18.0123C10.5547 18.0123 10.2686 17.8938 10.0576 17.6829L2.03977 9.66504C1.01157 8.60462 0.441721 7.18232 0.453298 5.7053C0.464875 4.22829 1.05695 2.81509 2.10165 1.77092V1.77317Z" fill="#323433" fillOpacity="0.5" />
</svg></span>
                , чтобы сохранить любимые товары, следить за снижением цен и акциями
              </p>
            </div>
          </div>

          <Link href="/catalog" className={styles.catalogButton}>
            <span>В каталог</span>
            <svg width="33" height="12" viewBox="0 0 33 12" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M1.5 5.25C1.08579 5.25 0.75 5.58579 0.75 6C0.75 6.41421 1.08579 6.75 1.5 6.75V5.25ZM32.0303 6.53033C32.3232 6.23744 32.3232 5.76256 32.0303 5.46967L27.2574 0.696699C26.9645 0.403806 26.4896 0.403806 26.1967 0.696699C25.9038 0.989593 25.9038 1.46447 26.1967 1.75736L30.4393 6L26.1967 10.2426C25.9038 10.5355 25.9038 11.0104 26.1967 11.3033C26.4896 11.5962 26.9645 11.5962 27.2574 11.3033L32.0303 6.53033ZM1.5 6.75H31.5V5.25H1.5V6.75Z" fill="#C1A286"></path></svg>
          </Link>
        </div>
      )}
    </main>
  );
} 